coko/com.elster.jupiter.cim.webservices.inbound.soap/src/test/resources/samples/meterreadings/GetUsagePointReadingsRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:get="http://iec.ch/TC57/2011/GetMeterReadingsMessage" xmlns:mes="http://iec.ch/TC57/2011/schema/message" xmlns:get1="http://iec.ch/TC57/2011/GetMeterReadings#">
    <soapenv:Header/>
    <soapenv:Body>
        <get:GetMeterReadings>
            <get:Header>
                <mes:Verb>get</mes:Verb>
                <mes:Noun>MeterReadings</mes:Noun>
            </get:Header>
            <get:Request>
                <get1:GetMeterReadings>
                    <!-- Required -->
                    <get1:Reading>
                        <!-- Optional -->
                        <!-- No source => source = System -->
                        <get1:source>System</get1:source>
                        <!-- Required -->
                        <get1:timePeriod>
                            <!-- Optional -->
                            <!-- No end => time period = (start, now) -->
                            <get1:end>2017-07-13T00:00:00+03:00</get1:end>
                            <!-- Required -->
                            <get1:start>2017-07-01T00:00:00+03:00</get1:start>
                        </get1:timePeriod>
                    </get1:Reading>
                    <!-- Optional -->
                    <!-- No reading type => read all reading types -->
                    <get1:ReadingType>
                        <!-- Optional -->
                        <!-- No MRID => identification by full alias name -->
                        <!-- No MRID & name => error -->
                        <get1:mRID>11.0.0.4.1.1.12.0.0.0.0.0.0.0.0.3.72.0</get1:mRID>
                        <!-- Optional -->
                        <!-- No MRID => identification by full alias name -->
                        <!-- No MRID & name => error -->
                        <get1:Names>
                            <get1:name>[Daily] Secondary Delta A+ (kWh)</get1:name>
                        </get1:Names>
                    </get1:ReadingType>
                    <!-- Optional -->
                    <!-- Either EndDevice or UsagePoint must be present -->
                    <get1:UsagePoint>
                        <!-- Optional -->
                        <!-- No MRID => identification by name with NameType = UsagePointName -->
                        <!-- No MRID & name => error -->
                        <get1:mRID>00000000-0000-0000-0000-0000000000ff</get1:mRID>
                        <!-- Optional -->
                        <!-- No MRID => identification by name with NameType = UsagePointName -->
                        <!-- No MRID & name => error -->
                        <get1:Names>
                            <get1:name>K@#Ø%!</get1:name>
                            <get1:NameType>
                                <get1:name>UsagePointName</get1:name>
                            </get1:NameType>
                        </get1:Names>
                        <!-- Optional -->
                        <!-- No purpose name => read all purposes -->
                        <get1:Names>
                            <get1:name>Billing</get1:name>
                            <get1:NameType>
                                <get1:name>Purpose</get1:name>
                            </get1:NameType>
                        </get1:Names>
                    </get1:UsagePoint>
                </get1:GetMeterReadings>
            </get:Request>
        </get:GetMeterReadings>
    </soapenv:Body>
</soapenv:Envelope>
